InformationRegisters/НастройкиКадровыхРешений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиКадровыхРешений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОПриемеНаРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОКадровомПереводе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОбУвольнении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОВосстановленииВДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КадровыеДокументыПоРешениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КадровыеДокументыПоРешениям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КадровыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КадровыйПеревод</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеВДолжности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПереводСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КадровоеРешение</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СотрудникиПоРешениямОПриемеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиПоРешениямОПриемеНаРаботу</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РешениеОПриемеНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОплатыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФОТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованныйДоход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РешениеОКадровомПереводе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РешениеОКадровомПереводе</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Document.ЗаключениеМедицинскогоОсмотра</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОбновлениеЗаданийАдаптацииУвольнения</xr:Item>
				<xr:Item>InformationRegister.МероприятияАдаптацииУвольненияПоДокументу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованныйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаетДистанционно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплатыТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОплатыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПодразделениеИДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьТерриторию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьДистанционнуюРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьОплатуТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МероприятияАдаптацииУвольнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияАдаптацииУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Плановый срок исполнения задачи</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РешениеОбОтпускеПоУходуЗаРебенком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РешениеОбОтпускеПоУходуЗаРебенком</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОбновлениеЗаданийАдаптацииУвольнения</xr:Item>
				<xr:Item>InformationRegister.МероприятияАдаптацииУвольненияПоДокументу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МероприятияАдаптацииУвольнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияАдаптацииУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Плановый срок исполнения задачи</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/КадровыеРешенияРасширенный/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнениеОплатыТрудаВРешенияхОПриемеНаРаботу");
	Методы.Вставить("УстановитьФОКадровыхРешений");
	Методы.Вставить("ЗаполнениеОплатыТрудаВРешенияхОКадровомПереводе");
	Методы.Вставить("ИсправитьРешенияОПриемеСОдинаковымиКандидатами");
	Методы.Вставить("ЗаполнитьКадровыеДокументыПоРешениям");
	Методы.Вставить("РаспределениеПрисоединенныхФайловРешенийПоКадровымИзменениям");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.13.54";
	Обработчик.Процедура = "КадровыеРешенияРасширенный.ЗаполнитьКадровыеДокументыПоРешениям";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("87676bf9-d384-47b3-a4fa-1430c73bea18");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение списка кадровых документов, введенных на основании решений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.22.7";
	Обработчик.Процедура = "КадровыеРешенияРасширенный.ЗаполнениеОплатыТрудаВРешенияхОКадровомПереводе";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6d515790-00d9-4589-9d8b-d6ddfec05202");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение оплаты труда решений о кадровом переводе.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.22.7";
	Обработчик.Процедура = "КадровыеРешенияРасширенный.ЗаполнениеОплатыТрудаВРешенияхОПриемеНаРаботу";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a3d519ae-4c7c-47fb-ab79-4be3cbd0c39e");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение оплаты труда решений о приеме на работу.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.2";
	Обработчик.Процедура = "КадровыеРешенияРасширенный.РаспределениеПрисоединенныхФайловРешенийПоКадровымИзменениям";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("de5cd107-377b-4cf3-9121-edb05012725a");
	Обработчик.Комментарий = НСтр("ru = 'Распределение присоединенных файлов решений по кадровым изменениям.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.25.11";
	Обработчик.Процедура = "КадровыеРешенияРасширенный.УстановитьФОКадровыхРешений";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("bbea22b0-9097-4be7-8453-c0cd0c51f54f");
	Обработчик.Комментарий = НСтр("ru = 'Установка функциональных опций использования кадровых решений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.25.11";
	Обработчик.Процедура = "КадровыеРешенияРасширенный.СвязатьСотрудниковСРешениямиОПриемеНаРаботу";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b37a3649-1b3b-4eef-a0e9-47809cd3424d");
	Обработчик.Комментарий = НСтр("ru = 'Создание новых сотрудников и связывание существующих с решениями о приеме на работу.'");
	
	Обработчик.Версия = "3.1.25.129";
	Обработчик.Процедура = "КадровыеРешенияРасширенный.ИсправитьРешенияОПриемеСОдинаковымиКандидатами";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("baffebef-d602-4fd4-857d-d6e26297da1b");
	Обработчик.Комментарий = НСтр("ru = 'Исправление решений о приеме на работу с одинаковыми кандидатами.'");
	
КонецПроцедуры

Процедура ДобавитьПодменюРешенияПоКадровымИзменениям(ОписаниеМеню) Экспорт
	
	ПунктыМеню = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОКадровомПереводе") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОКадровомПереводе) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОКадровомПереводе");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОбУвольнении") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОбУвольнении) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОбУвольнении");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОбОтпускеПоУходуЗаРебенком) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОбОтпускеПоУходуЗаРебенком");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОВосстановленииВДолжности") 
		И ПравоДоступа("Добавление", Метаданные.Документы.РешениеОВосстановленииВДолжности) Тогда
		ПунктыМеню.Добавить("Документы.РешениеОВосстановленииВДолжности");
	КонецЕсли;
	
	Если ПунктыМеню.Количество() > 0 Тогда
		ОписаниеМеню.Пункты.Добавить(СотрудникиФормы.РазделМеню(НСтр("ru = 'Решения'"), ПунктыМеню));
	КонецЕсли;
	
КонецПроцедуры

Функция НастройкиКадровыхРешений() Экспорт
	Возврат РегистрыСведений.НастройкиКадровыхРешений.Настройки();
КонецФункции

Процедура УстановитьНастройкиКадровыхРешений(Настройки) Экспорт
	РегистрыСведений.НастройкиКадровыхРешений.УстановитьНастройки(Настройки);
КонецПроцедуры

Функция ДанныеДляПроведенияРешениеОПриемеНаРаботу(Ссылка, ФизическоеЛицо, ДолжностьПоШтатномуРасписанию, ДатаПриема) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	Мероприятия.Мероприятие КАК Мероприятие,
	|	Мероприятия.ДатаНачала КАК ДатаНачала,
	|	Мероприятия.ДатаОкончания КАК ДатаОкончания,
	|	Мероприятия.Исполнитель КАК Исполнитель
	|ИЗ
	|	Документ.РешениеОПриемеНаРаботу.МероприятияАдаптацииУвольнения КАК Мероприятия
	|ГДЕ
	|	Мероприятия.Ссылка = &Ссылка";
		
	ДанныеМероприятий = Запрос.Выполнить().Выгрузить();
	ДанныеМероприятий.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ДанныеМероприятий.ЗаполнитьЗначения(ФизическоеЛицо, "ФизическоеЛицо");
	ДанныеМероприятий.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.СобытияАдаптацииУвольнения.Тип));
	ДанныеМероприятий.ЗаполнитьЗначения(Ссылка, "ДокументОснование");
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ПлановыеДвиженияСотрудников = Новый ТаблицаЗначений;
	Иначе
		Запрос.УстановитьПараметр("Подразделение", ОрганизационнаяСтруктура.МестоПозицииВСтруктуреПредприятия(
			ДолжностьПоШтатномуРасписанию, ДатаПриема));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Подразделение КАК Подразделение,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.Мероприятие КАК Мероприятие,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.ДатаНачала КАК ДатаНачала,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.ДатаОкончания КАК ДатаОкончания,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.Ответственный КАК Ответственный,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.СуммаРасходов КАК СуммаРасходов
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу.ПрограммаОбучения КАК РешениеОПриемеНаРаботуПрограммаОбучения
		|ГДЕ
		|	РешениеОПриемеНаРаботуПрограммаОбучения.Ссылка = &Ссылка";
		ПлановыеДвиженияСотрудников = Запрос.Выполнить().Выгрузить();
		ПлановыеДвиженияСотрудников.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		ПлановыеДвиженияСотрудников.ЗаполнитьЗначения(ФизическоеЛицо, "ФизическоеЛицо");
	КонецЕсли;
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДанныеМероприятийАдаптацииУвольнения", ДанныеМероприятий);
	ДанныеДляПроведения.Вставить("ПлановыеДвиженияСотрудников", ПлановыеДвиженияСотрудников);
	
	Возврат ДанныеДляПроведения;

КонецФункции

Процедура ЗаполнитьРешениеОПриемеНаРаботуПоДаннымКандидата(ДокументОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт

	Если ТипЗнч(ДанныеЗаполнения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(ДанныеЗаполнения);
	Если ДанныеКандидата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКандидата.Состояние <> Перечисления.СостоянияСогласования.Согласовано Тогда
		ВызватьИсключение НСтр("ru = 'Кандидат не утвержден. 
                                |Решение о приеме на работу вводится для утвержденных (одобренных) кандидатов.'");
	КонецЕсли;
	
	ПараметрыДанных = Справочники.Вакансии.ПараметрыПолученияДанныхВакансии();
	ПараметрыДанных.Согласование = Истина;
	
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(ДанныеКандидата.Вакансия, ПараметрыДанных);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеВакансий") Тогда
		Если Не ЗначениеЗаполнено(ДанныеКандидата.Вакансия) Тогда
			ВызватьИсключение НСтр("ru = 'Вакансия не заполнена. 
	                                |Решение о приеме на работу вводится для кандидата на согласованную вакансию.'");
		КонецЕсли;
		Если ДанныеВакансии.Согласование = Неопределено 
			Или ДанныеВакансии.Согласование.СостояниеСогласования <> Перечисления.СостоянияСогласования.Согласовано Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Вакансия %1 не согласована. 
	                  |Решение о приеме на работу вводится для кандидата на согласованную вакансию.'"),
				ДанныеКандидата.Вакансия);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.Кандидат = ДанныеКандидата.Кандидат;
	ДокументОбъект.ЛичныеДанныеКандидата = ДанныеКандидата.ЛичныеДанныеКандидата;
	ДокументОбъект.Подразделение = ДанныеВакансии.Подразделение;
	ДокументОбъект.Должность = ДанныеВакансии.Должность;
	ДокументОбъект.ПрофильДолжности = ДанныеВакансии.ПрофильДолжности;
	ДокументОбъект.НоваяПозиция = ДанныеВакансии.НоваяПозиция;
	ДокументОбъект.РабочееМесто = ДанныеВакансии.РабочееМесто;
	ДокументОбъект.ИспытательныйСрок = ДанныеВакансии.ИспытательныйСрок;
	ДокументОбъект.ФизическоеЛицо = ДанныеКандидата.ФизическоеЛицо;
	
	СуммаВВалютеПоУмолчанию = ПодборПерсоналаКлиентСервер.СуммаВВалютеПоУмолчанию(
		ДанныеКандидата.ОжидаемыйДоход, ДанныеКандидата.ВалютаДохода);
	ДокументОбъект.СогласованныйДоход = ПодборПерсоналаКлиентСервер.ОжидаемыйДоходВМесяц(
		СуммаВВалютеПоУмолчанию, ДанныеКандидата.ПериодичностьДохода);
	
	Если Не ДанныеВакансии.НоваяПозиция Тогда
		ДокументОбъект.ДолжностьПоШтатномуРасписанию = ДанныеВакансии.Позиция;
		ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(ДанныеВакансии.Позиция);
		ДокументОбъект.Организация = ДанныеПозиции.Организация;
	КонецЕсли;

КонецПроцедуры


#Область КадровыеДокументы

Процедура ОбработкаЗаполненияКадровогоПриказа(ДокументОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если Не Метаданные.ОпределяемыеТипы.КадровоеРешение.Тип.СодержитТип(ТипДанныхЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОКадровомПереводе") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаНачала");
		КопируемыеРеквизиты.Добавить("ДатаОкончания");
		КопируемыеРеквизиты.Добавить("Подразделение");
		КопируемыеРеквизиты.Добавить("Территория");
		КопируемыеРеквизиты.Добавить("ДолжностьПоШтатномуРасписанию");
		КопируемыеРеквизиты.Добавить("ОбособленноеПодразделение");
		КопируемыеРеквизиты.Добавить("Организация");
		КопируемыеРеквизиты.Добавить("Сотрудник"); 
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо");
		КопируемыеРеквизиты.Добавить("РабочееМесто");
		КопируемыеРеквизиты.Добавить("РаботаетДистанционно");
		КопируемыеРеквизиты.Добавить("ИзменитьПодразделениеИДолжность");
		КопируемыеРеквизиты.Добавить("ИзменитьТерриторию");
		КопируемыеРеквизиты.Добавить("ИзменитьРабочееМесто");
		КопируемыеРеквизиты.Добавить("ИзменитьДистанционнуюРаботу");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, 
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты));
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОбУвольнении") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаУвольнения");
		КопируемыеРеквизиты.Добавить("Организация");
		КопируемыеРеквизиты.Добавить("Сотрудник");
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, 
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты));
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОбОтпускеПоУходуЗаРебенком") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаНачала");
		КопируемыеРеквизиты.Добавить("Организация");
		КопируемыеРеквизиты.Добавить("ОсновнойСотрудник");
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо");
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		ДокументОбъект.Сотрудник = ЗначенияРеквизитов.ФизическоеЛицо;
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОВосстановленииВДолжности") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаВосстановления"); 
		КопируемыеРеквизиты.Добавить("Организация"); 
		КопируемыеРеквизиты.Добавить("Сотрудник"); 
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо"); 
		КопируемыеРеквизиты.Добавить("ДолжностьПоШтатномуРасписанию");
		КопируемыеРеквизиты.Добавить("ДокументОснование");
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		
		РеквизитыПозиции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитов.ДолжностьПоШтатномуРасписанию, "Подразделение, Должность");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, РеквизитыПозиции);
		
		ПриказСвязанныйСОснованием = КадровыеРешения.СвязанныйСРешениемПриказ(ЗначенияРеквизитов.ДокументОснование); // ДокументСсылка.Увольнение
		Если ЗначениеЗаполнено(ПриказСвязанныйСОснованием) Тогда
			ДокументОбъект.ДокументУвольнения = ПриказСвязанныйСОснованием;
			ДокументОбъект.ДатаУвольнения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПриказСвязанныйСОснованием, "ДатаУвольнения");
		КонецЕсли;
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком") Тогда
		КопируемыеРеквизиты = Новый Массив;
		КопируемыеРеквизиты.Добавить("ДатаВозврата");
		КопируемыеРеквизиты.Добавить("Организация"); 
		КопируемыеРеквизиты.Добавить("ОсновнойСотрудник");
		КопируемыеРеквизиты.Добавить("ФизическоеЛицо");
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, КопируемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		ДокументОбъект.Сотрудник = ЗначенияРеквизитов.ФизическоеЛицо;
		ПриказСвязанныйСОснованием = КадровыеРешения.СвязанныйСРешениемПриказ(ДанныеЗаполнения.ДокументОснование);
		Если ЗначениеЗаполнено(ПриказСвязанныйСОснованием) Тогда
			ДокументОбъект.ДокументОснование = ПриказСвязанныйСОснованием;
		КонецЕсли;
	КонецЕсли;

	ДокументОбъект.Решение = ДанныеЗаполнения;
	
КонецПроцедуры

Функция ПравоЧтенияРешения(КадровыйДокумент) Экспорт
	
	ТипДокумента = ТипЗнч(КадровыйДокумент);
	Если ЭтоПриемНаРаботу(ТипДокумента)
		И ПравоДоступа("Чтение", Метаданные.Документы.РешениеОПриемеНаРаботу) Тогда
		ПравоЧтенияРешения = Истина;
	ИначеЕсли ЭтоКадровыйПеревод(ТипДокумента)
		И ПравоДоступа("Чтение", Метаданные.Документы.РешениеОКадровомПереводе) Тогда
		ПравоЧтенияРешения = Истина;
	ИначеЕсли ЭтоУвольнение(ТипДокумента)
		И ПравоДоступа("Чтение", Метаданные.Документы.РешениеОбУвольнении) Тогда
		ПравоЧтенияРешения = Истина;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком")
		И ПравоДоступа("Чтение", Метаданные.Документы.РешениеОбОтпускеПоУходуЗаРебенком) Тогда
		ПравоЧтенияРешения = Истина;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратИзОтпускаПоУходуЗаРебенком")
		И ПравоДоступа("Чтение", Метаданные.Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком) Тогда
		ПравоЧтенияРешения = Истина;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВосстановлениеВДолжности")
		И ПравоДоступа("Чтение", Метаданные.Документы.РешениеОВосстановленииВДолжности) Тогда
		ПравоЧтенияРешения = Истина;
	Иначе
		ПравоЧтенияРешения = Ложь;
	КонецЕсли;
	
	Возврат ПравоЧтенияРешения;
	
КонецФункции

Функция ИспользуетсяРешение(КадровыйДокумент) Экспорт
	
	Настройки = НастройкиКадровыхРешений();
	ТипДокумента = ТипЗнч(КадровыйДокумент);
	
	Если ЭтоПриемНаРаботу(ТипДокумента)
		И Настройки.ИспользоватьРешениеОПриемеНаРаботу Тогда
		ИспользуетсяРешение = Истина;
	ИначеЕсли ЭтоКадровыйПеревод(ТипДокумента)
		И Настройки.ИспользоватьРешениеОКадровомПереводе Тогда
		ИспользуетсяРешение = Истина;
	ИначеЕсли ЭтоУвольнение(ТипДокумента)
		И Настройки.ИспользоватьРешениеОбУвольнении Тогда
		ИспользуетсяРешение = Истина;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком")
		И Настройки.ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком Тогда
		ИспользуетсяРешение = Истина;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратИзОтпускаПоУходуЗаРебенком")
		И Настройки.ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком Тогда
		ИспользуетсяРешение = Истина;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВосстановлениеВДолжности")
		И Настройки.ИспользоватьРешениеОВосстановленииВДолжности Тогда
		ИспользуетсяРешение = Истина;
	Иначе
		ИспользуетсяРешение = Ложь;
	КонецЕсли;
	
	Возврат ИспользуетсяРешение;
	
КонецФункции

#КонецОбласти

#Область ДатыЗапретаИзменения

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОбОтпускеПоУходуЗаРебенком", "ДатаНачала", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОбУвольнении", "ДатаУвольнения", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком", "ДатаВозврата", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОВосстановленииВДолжности", "ДатаВосстановления", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, 
		"Документ.РешениеОКадровомПереводе", "ДатаНачала", "ПодборПерсонала", "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.РешениеОбОтпускеПоУходуЗаРебенком);
	СписокОбъектов.Добавить(Документы.РешениеОбУвольнении);
	СписокОбъектов.Добавить(Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком);
	СписокОбъектов.Добавить(Документы.РешениеОВосстановленииВДолжности);
	СписокОбъектов.Добавить(Документы.РешениеОКадровомПереводе);
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"d42dbf90-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОбОтпускеПоУходуЗаРебенком);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"d42dbefa-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОбУвольнении);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"d42dc003-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"d42dbfc2-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОВосстановленииВДолжности);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"c091b4dd-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РешениеОКадровомПереводе);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.РешенияПоКадровымИзменениямПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОбОтпускеПоУходуЗаРебенкомПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОВосстановленииВДолжностиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОВозвратеИзОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОКадровомПереводеПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РешениеОбУвольненииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОбОтпускеПоУходуЗаРебенком, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОбУвольнении, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОВосстановленииВДолжности, Истина);
	Списки.Вставить(Метаданные.Документы.РешениеОКадровомПереводе, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.РешенияПоКадровымИзменениям, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// При заполнении таблицы объектов регистрирующих зависимые объекты.
// 
// Параметры:
//  ДанныеРегистрации - ТаблицаЗначений
Процедура ПриЗаполненииТаблицыОбъектовРегистрирующихЗависимыеОбъекты(ДанныеРегистрации) Экспорт
	
	// Метаданные.Документы.РешениеОКадровомПереводе
	НоваяСтрока = ДанныеРегистрации.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.Документы.РешениеОКадровомПереводе;
	
КонецПроцедуры

Процедура ДополнитьОбъектыИзмененияОрганизацийФизическихЛиц(МассивОбъектов) Экспорт
	МассивОбъектов.Добавить(Метаданные.Документы.РешениеОКадровомПереводе);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеБлокируемыхДанных(МетаданныеОбъекта)
	Описание = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОписаниеБлокируемыхДанных(МетаданныеОбъекта);
	Описание.ПоляБлокировки.Очистить();
	Возврат Описание;
КонецФункции

Функция ПрисоединенныйФайлПоТипуЗначения(ТипЗначения)
	
	Если ТипЗначения = Тип("ДокументСсылка.РешениеОПриемеНаРаботу") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОбУвольнении") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОВозвратеИзОтпускаПоУходуЗаРебенком") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОВосстановленииВДолжности") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОКадровомПереводе") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РешениеОбОтпускеПоУходуЗаРебенком") Тогда
		ПрисоединенныйФайл = Справочники.РешениеОПриемеНаРаботуПрисоединенныеФайлы.СоздатьЭлемент();
	Иначе
		ПрисоединенныйФайл = Неопределено;
	КонецЕсли;
	
	Возврат ПрисоединенныйФайл;
	
КонецФункции

Функция ЭтоПриемНаРаботу(ТипДокумента)
	
	Если ТипДокумента = Тип("ДокументСсылка.ПриемНаРаботу")
		Или ТипДокумента = Тип("ДокументСсылка.ПриемНаРаботуСписком") Тогда
		ЭтоПриемНаРаботу = Истина;
	Иначе
		ЭтоПриемНаРаботу = Ложь;
	КонецЕсли;
	
	Возврат ЭтоПриемНаРаботу;
	
КонецФункции

Функция ЭтоКадровыйПеревод(ТипДокумента)
	
	Если ТипДокумента = Тип("ДокументСсылка.КадровыйПеревод")
		Или ТипДокумента = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
		ЭтоКадровыйПеревод = Истина;
	Иначе
		ЭтоКадровыйПеревод = Ложь;
	КонецЕсли;
	
	Возврат ЭтоКадровыйПеревод;
	
КонецФункции

Функция ЭтоУвольнение(ТипДокумента)
	
	Если ТипДокумента = Тип("ДокументСсылка.Увольнение")
		Или ТипДокумента = Тип("ДокументСсылка.УвольнениеСписком") Тогда
		ЭтоУвольнение = Истина;
	Иначе
		ЭтоУвольнение = Ложь;
	КонецЕсли;
	
	Возврат ЭтоУвольнение;
	
КонецФункции

#Область ОбновлениеИБ

// Заполнить кадровые документы по решениям.
// 
// Параметры:
//  ПараметрыОбновления - Структура - Параметры обновления:
//	* ОбработкаЗавершена - Булево
Процедура ЗаполнитьКадровыеДокументыПоРешениям(ПараметрыОбновления) Экспорт
	
	Запрос = ЗапросЗаполненияКадровыхДокументовПоРешениям();
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.КадровыеДокументыПоРешениям.СоздатьНаборЗаписей();
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		НаборЗаписей.Отбор.Решение.Установить(Выборка.Решение);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Функция ЗапросЗаполненияКадровыхДокументовПоРешениям()
		
	ПустыеРешения = Новый Массив;
	Для Каждого ТипРешения Из Метаданные.ОпределяемыеТипы.КадровоеРешение.Тип.Типы() Цикл
		ПустыеРешения.Добавить(Новый(ТипРешения));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустыеРешения", ПустыеРешения);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ПриемНаРаботу КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ПриемНаРаботуСписком.Сотрудники КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ КадровыеДокументы.Ссылка.ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.КадровыйПеревод КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.КадровыйПереводСписком.Сотрудники КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ КадровыеДокументы.Ссылка.ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.Увольнение КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.УвольнениеСписком.Сотрудники КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ КадровыеДокументы.Ссылка.ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ОтпускПоУходуЗаРебенком КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ВозвратИзОтпускаПоУходуЗаРебенком КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДокументы.Ссылка КАК КадровыйДокумент,
		|	КадровыеДокументы.Решение
		|ИЗ
		|	Документ.ВосстановлениеВДолжности КАК КадровыеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеДокументыПоРешениям КАК РешенияПоКадровымДокументам
		|		ПО РешенияПоКадровымДокументам.КадровыйДокумент = КадровыеДокументы.Ссылка
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И КадровыеДокументы.Решение НЕ В (&ПустыеРешения)
		|	И РешенияПоКадровымДокументам.Решение ЕСТЬ NULL";
	
	Возврат Запрос;
	
КонецФункции

// Процедура выполняет заполнение данных оплаты труда решений о кадровом переводе
//
Процедура ЗаполнениеОплатыТрудаВРешенияхОКадровомПереводе(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	РешениеОКадровомПереводе.Ссылка КАК Решение
		|ИЗ
		|	Документ.РешениеОКадровомПереводе КАК РешениеОКадровомПереводе
		|ГДЕ
		|	РешениеОКадровомПереводе.ВариантОплатыТруда = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыТруда.ПустаяСсылка)";
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.РешениеОКадровомПереводе");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Решение = Выборка.Решение.ПолучитьОбъект();
			Решение.ИзменитьПодразделениеИДолжность = Истина;
			Если ЗначениеЗаполнено(Решение.ДолжностьПоШтатномуРасписанию) Тогда
				Решение.ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.ФОТ;
			Иначе
				Решение.ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.СогласованныйДоход;
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Решение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет распределение присоединенных файлов решений по кадровым изменениям
//
Процедура РаспределениеПрисоединенныхФайловРешенийПоКадровымИзменениям(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РешенияПоКадровымИзменениямПрисоединенныеФайлы КАК ПрисоединенныеФайлы
		|ГДЕ
		|	НЕ ПрисоединенныеФайлы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить(
		Метаданные.Справочники.РешенияПоКадровымИзменениямПрисоединенныеФайлы.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПрисоединенныйФайлНовый = ПрисоединенныйФайлПоТипуЗначения(ТипЗнч(Выборка.Ссылка.ВладелецФайла));
			Если ПрисоединенныйФайлНовый = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ПрисоединенныйФайлНовый, Выборка.Ссылка,, "Владелец, Ссылка, Родитель");
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПрисоединенныйФайлНовый);
			ПрисоединенныйФайлСтарый = Выборка.Ссылка.ПолучитьОбъект();
			ПрисоединенныйФайлСтарый.ПометкаУдаления = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПрисоединенныйФайлСтарый);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьФОКадровыхРешений(ПараметрыОбновления) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ИспользоватьАдаптациюУвольнение
		|ИЗ
		|	Константа.ИспользоватьАдаптациюУвольнение КАК НастройкаАдаптации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиКадровыхРешений КАК Настройки
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НастройкаАдаптации.Значение = ИСТИНА
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОбУвольнении, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОВосстановленииВДолжности, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОКадровомПереводе, ЛОЖЬ) = ЛОЖЬ
		|	И ЕСТЬNULL(Настройки.ИспользоватьРешениеОПриемеНаРаботу, ЛОЖЬ) = ЛОЖЬ";
	
	ОписаниеДанных = Новый Массив;
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.НастройкиКадровыхРешений));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Константы.ИспользоватьАдаптациюУвольнение));

	Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеДанных, ПараметрыОбновления) Тогда
		Возврат;
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.НастройкиКадровыхРешений.СоздатьНаборЗаписей();
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОбУвольнении = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОВосстановленииВДолжности = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОКадровомПереводе = Выборка.ИспользоватьАдаптациюУвольнение;
		СтрокаНабора.ИспользоватьРешениеОПриемеНаРаботу = Выборка.ИспользоватьАдаптациюУвольнение;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

// Заполняет кандидатов в решениях о приеме на работу при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
//  
// Возвращаемое значение:
//  Булево - Истина если все документы уже обработаны, иначе Ложь.
Функция ЗаполнитьКандидатов(ПараметрыОбновления) Экспорт
	
	ОбработанныеДокументы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыОбновления, "ОбработанныеДокументы", Новый Массив); // Массив Из ДокументСсылка.РешениеОПриемеНаРаботу
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Документы.РешениеОПриемеНаРаботу.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ОбрабатываемыеДокументы = ДокументыБезКандидатов(ОбработанныеДокументы);
		
		Если ОбрабатываемыеДокументы.Количество() = 0 Тогда
			ЗафиксироватьТранзакцию();
			Возврат Истина;
		КонецЕсли;
		
		ФизическиеЛица = ОбщегоНазначенияКлиентСервер.СвернутьМассив(
			ОбрабатываемыеДокументы.ВыгрузитьКолонку("ФизическоеЛицо"));
		
		Кандидаты = ПодборПерсонала.КандидатыФизическихЛиц(ФизическиеЛица);
		
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаСотрудников = КадровыйУчет.СотрудникиФизическихЛиц(ФизическиеЛица);
		УстановитьПривилегированныйРежим(Ложь);
		ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаСотрудников, "ФизическоеЛицо");
	
		ИсключаемыеКандидаты = КандидатыРешенийОПриеме();
		
		КоличествоОбработанныхДокументов = 0;
		Для Каждого СтрокаТаблицы Из ОбрабатываемыеДокументы Цикл
			
			Кандидат = КандидатФизическогоЛица(СтрокаТаблицы.ФизическоеЛицо, Кандидаты, ИсключаемыеКандидаты,
				ТаблицаСотрудников);

			Если ЗначениеЗаполнено(Кандидат) Тогда
				ЗаполнитьКандидатаВДокументе(СтрокаТаблицы.Документ, Кандидат);
				НоваяСтрока = ИсключаемыеКандидаты.Добавить();
				НоваяСтрока.Кандидат = Кандидат;
			КонецЕсли;
			
			КоличествоОбработанныхДокументов = КоличествоОбработанныхДокументов + 1;
			ОбработанныеДокументы.Добавить(СтрокаТаблицы.Документ);
			
		КонецЦикла;

		ПараметрыОбновления.Вставить("ОбработанныеДокументы", ОбработанныеДокументы);
		ЗафиксироватьТранзакцию();
		
		Возврат КоличествоОбработанныхДокументов = 0;
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения кандидатов в документах Решение о приеме на работу'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.РешениеОПриемеНаРаботу);
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

// Исправляет ситуацию, когда существуют несколько решений о приеме на работу с одинаковым кандидатом.
// В результате остается один документ по кандидату.
// В остальных документах кандидат, при возможности, заменяется на другого или очищается.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ИсправитьРешенияОПриемеСОдинаковымиКандидатами(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Документы.РешениеОПриемеНаРаботу.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		РезультатЗапроса = РезультатЗапросаКандидатовСНесколькимиРешениями();
		
		Если РезультатЗапроса = Неопределено Или РезультатЗапроса.Пустой() Тогда
			ЗафиксироватьТранзакцию();
			ПараметрыОбновления.ОбработкаЗавершена = Истина;
			Возврат;
		КонецЕсли;
		
		ДокументыРешения = Новый Массив; // Массив из ДокументСсылка.РешениеОПриемеНаРаботу
		
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока Выборка.СледующийПоЗначениюПоля("Документ") Цикл
			ДокументыРешения.Добавить(Выборка.Документ);
		КонецЦикла;
		СотрудникиРешений = РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу.СотрудникиПоРешениямОПриемеНаРаботу(
			ДокументыРешения);
		
		ВыборкаКандидатов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		КоличествоОбработанныхДокументов = 0;
		
		Пока ВыборкаКандидатов.Следующий() Цикл
			
			ИсключаемыеКандидаты = Новый ТаблицаЗначений();
			ИсключаемыеКандидаты.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
			
			ФизическоеЛицо =  Неопределено;
			
			ВыборкаДокументы = ВыборкаКандидатов.Выбрать();
			Пока ВыборкаДокументы.Следующий() Цикл
				
				Кандидат = Справочники.Кандидаты.ПустаяСсылка();
				
				СотрудникРешения = СотрудникиРешений.Получить(ВыборкаДокументы.Документ);
				
				Если СотрудникРешения <> Неопределено Тогда
					
					КандидатыСотрудника = ПодборПерсонала.ПриоритетныеКандидатыПоСотрудникам(
						ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СотрудникРешения), ,
						ИсключаемыеКандидаты.ВыгрузитьКолонку("Кандидат"));
						
					Если КандидатыСотрудника.Количество() > 0 Тогда
						Кандидат = КандидатыСотрудника[0].Кандидат;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Кандидат) Тогда
					Если ВыборкаДокументы.ФизическоеЛицо <> ФизическоеЛицо Тогда
						ФизическоеЛицо =  ВыборкаДокументы.ФизическоеЛицо;
						ФизическиеЛица = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
						Кандидаты = ПодборПерсонала.КандидатыФизическихЛиц(ФизическиеЛица);
						ТаблицаСотрудников = КадровыйУчет.СотрудникиФизическихЛиц(ФизическиеЛица);
					КонецЕсли;
					Кандидат = КандидатФизическогоЛица(ФизическоеЛицо, Кандидаты, ИсключаемыеКандидаты, ТаблицаСотрудников);
				КонецЕсли;
				
				Если ВыборкаКандидатов.Кандидат <> Кандидат Тогда
					ЗаполнитьКандидатаВДокументе(ВыборкаДокументы.Документ, Кандидат);
					КоличествоОбработанныхДокументов = КоличествоОбработанныхДокументов + 1;
				КонецЕсли;
				
				НоваяСтрока = ИсключаемыеКандидаты.Добавить();
				НоваяСтрока.Кандидат = Кандидат;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		ПараметрыОбновления.ОбработкаЗавершена = КоличествоОбработанныхДокументов = 0;
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка при исправлении решений о приеме на работу с одинаковыми кандидатами'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.РешениеОПриемеНаРаботу);
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

Функция РезультатЗапросаКандидатовСНесколькимиРешениями()
	
	Если Метаданные.Документы.РешениеОПриемеНаРаботу.Реквизиты.Найти("ФизическоеЛицо") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РешениеОПриемеНаРаботу.Ссылка) КАК Ссылка,
		|	РешениеОПриемеНаРаботу.Кандидат
		|ПОМЕСТИТЬ ВТКандидаты
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|ГДЕ
		|	РешениеОПриемеНаРаботу.Проведен
		|	И РешениеОПриемеНаРаботу.Кандидат <> ЗНАЧЕНИЕ(Справочник.Кандидаты.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	РешениеОПриемеНаРаботу.Кандидат
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РешениеОПриемеНаРаботу.Ссылка) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РешениеОПриемеНаРаботу.Ссылка КАК Документ,
		|	РешениеОПриемеНаРаботу.Кандидат КАК Кандидат,
		|	РешениеОПриемеНаРаботу.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКандидаты КАК ВТКандидаты
		|		ПО РешениеОПриемеНаРаботу.Кандидат = ВТКандидаты.Кандидат
		|ИТОГИ
		|ПО
		|	Кандидат";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Параметры:
//  ОбработанныеДокументы - Массив из ДокументСсылка.РешениеОПриемеНаРаботу
//  
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * Документ - ДокументСсылка.РешениеОПриемеНаРаботу
//    * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
Функция ДокументыБезКандидатов(ОбработанныеДокументы)
	
	Если Метаданные.Документы.РешениеОПриемеНаРаботу.Реквизиты.Найти("ФизическоеЛицо") = Неопределено Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	РешениеОПриемеНаРаботу.Ссылка КАК Документ,
		|	РешениеОПриемеНаРаботу.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|ГДЕ
		|	РешениеОПриемеНаРаботу.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	И РешениеОПриемеНаРаботу.Кандидат = ЗНАЧЕНИЕ(Справочник.Кандидаты.ПустаяСсылка)
		|	И НЕ РешениеОПриемеНаРаботу.Ссылка В (&ОбработанныеДокументы)";
	
	Запрос.УстановитьПараметр("ОбработанныеДокументы", ОбработанныеДокументы);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции

Функция КандидатыРешенийОПриеме()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РешениеОПриемеНаРаботу.Кандидат
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|ГДЕ
		|	РешениеОПриемеНаРаботу.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Кандидаты = РезультатЗапроса.Выгрузить();
	Кандидаты.Индексы.Добавить("Кандидат");
	
	Возврат Кандидаты;
	
КонецФункции

Функция КандидатФизическогоЛица(ФизическоеЛицо, Кандидаты, ИсключаемыеКандидаты, ТаблицаСотрудников)
	
	Кандидат = Справочники.Кандидаты.ПустаяСсылка();
	
	НайденныеСтроки = Кандидаты.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Кандидат;
	КонецЕсли;
	
	ДоступныеКандидаты = Новый Массив;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		Если НайденнаяСтрока.ПометкаУдаления
			Или НайденнаяСтрока.Состояние = Перечисления.СостоянияСогласования.Отклонено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИсключаемыеКандидаты.Найти(НайденнаяСтрока.Кандидат, "Кандидат") = Неопределено Тогда
			ДоступныеКандидаты.Добавить(НайденнаяСтрока.Кандидат);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДоступныеКандидаты.Количество() = 0 Тогда
		Возврат Кандидат;
	ИначеЕсли ДоступныеКандидаты.Количество() = 1 Тогда
		Кандидат = ДоступныеКандидаты[0];
	Иначе
		НайденныеСотрудники = ТаблицаСотрудников.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
		Если НайденныеСотрудники.Количество() = 0 Тогда
			Кандидат = ДоступныеКандидаты[0];
		Иначе
			Сотрудники = Новый Массив;
			Для Каждого СтрокаТаблицыСотрудников Из НайденныеСотрудники Цикл
				Сотрудники.Добавить(СтрокаТаблицыСотрудников.Сотрудник);
			КонецЦикла;
			КандидатыСотрудников = ПодборПерсонала.ПриоритетныеКандидатыПоСотрудникам(Сотрудники, ,
				ИсключаемыеКандидаты.ВыгрузитьКолонку("Кандидат"));
			Если КандидатыСотрудников.Количество() > 0 Тогда
				Кандидат = КандидатыСотрудников[0].Кандидат;
			Иначе
				Кандидат = ДоступныеКандидаты[0].Кандидат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Кандидат;
	
КонецФункции

Процедура ЗаполнитьКандидатаВДокументе(РешениеОПриеме, Кандидат)
	
	ДокументОбъект = РешениеОПриеме.ПолучитьОбъект();
	ДокументОбъект.Кандидат = Кандидат;
	ДокументОбъект.ЛичныеДанныеКандидата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "ЛичныеДанные");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
	
КонецПроцедуры

// Процедура выполняет заполнение данных оплаты труда решений о приеме на работу
//
Процедура ЗаполнениеОплатыТрудаВРешенияхОПриемеНаРаботу(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	РешениеОПриемеНаРаботу.Ссылка КАК Решение
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|ГДЕ
		|	РешениеОПриемеНаРаботу.ВариантОплатыТруда = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыТруда.ПустаяСсылка)";
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.РешениеОПриемеНаРаботу");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Решение = Выборка.Решение.ПолучитьОбъект();
			Если ЗначениеЗаполнено(Решение.ДолжностьПоШтатномуРасписанию) Тогда
				Решение.ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.ФОТ;
			Иначе
				Решение.ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.СогласованныйДоход;
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Решение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Связать сотрудников с решениями о приеме на работу.
// 
// Параметры:
//  ПараметрыОбновления - Структура:
//	* ОбработкаЗавершена - Булево
Процедура СвязатьСотрудниковСРешениямиОПриемеНаРаботу(ПараметрыОбновления) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;

	РешенияБезФизическогоЛица = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыОбновления, "РешенияБезФизическогоЛица", Новый Массив); // Массив Из ДокументСсылка.РешениеОПриемеНаРаботу
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("РешенияБезФизическогоЛица", РешенияБезФизическогоЛица); 
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Решения.Ссылка КАК Ссылка,
		|	Решения.Кандидат КАК Кандидат,
		|	Решения.Организация КАК Организация
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК Решения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПоРешениямОПриемеНаРаботу КАК СотрудникиПоРешениям
		|		ПО (СотрудникиПоРешениям.Решение = Решения.Ссылка)
		|ГДЕ
		|	Решения.Проведен
		|	И СотрудникиПоРешениям.Сотрудник ЕСТЬ NULL
		|	И НЕ Решения.Ссылка В (&РешенияБезФизическогоЛица)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Решения.Дата УБЫВ";
	
	ОписаниеДанных = Новый Массив;
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Документы.РешениеОПриемеНаРаботу));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Справочники.Сотрудники));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу));

	Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеДанных, ПараметрыОбновления) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;

	Кандидаты = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Кандидат"); // Массив Из СправочникСсылка.Кандидаты
	
	СотрудникиПоКандидатам = ПодборПерсонала.СотрудникиПоКандидатам(Кандидаты);
	ФизическиеЛицаПоКандидатам = Справочники.Кандидаты.ФизическиеЛицаКандидатов(Кандидаты);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Сотрудник = СотрудникиПоКандидатам.Получить(Выборка.Кандидат);
		Если Сотрудник = Неопределено Тогда
			Если ФизическиеЛицаПоКандидатам[Выборка.Кандидат] = Неопределено Тогда
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Обновление информационной базы.Связать сотрудников с решениями о приеме на работу'", 
						ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Предупреждение, , , 
					СтрШаблон(
						НСтр("ru = 'Для кандидата %1 проведено решение о приеме на работу %2, но при этом не удалось обнаружить физическое лицо.
							 |Для этого решения сотрудник не был создан.
							 |Необходимо создать физическое лицо для кандидата %1, затем перепровести документ.'"),
						Выборка.Кандидат,
						Выборка.Ссылка));
				РешенияБезФизическогоЛица.Добавить(Выборка.Ссылка);
				Продолжить;
			КонецЕсли;
			Сотрудник = КадровыйУчет.НовыйСотрудникФизическогоЛица(
				ФизическиеЛицаПоКандидатам[Выборка.Кандидат], Выборка.Организация);
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Решение.Установить(Выборка.Ссылка);
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.Решение = Выборка.Ссылка;
		СтрокаНабора.Сотрудник = Сотрудник;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);

	ПараметрыОбновления.Вставить("РешенияБезФизическогоЛица", РешенияБезФизическогоЛица);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
